# Используйте базовый образ Python
FROM python:3.9.13

# Установите рабочую директорию внутри контейнера
WORKDIR /app

# Скопируйте зависимости проекта в контейнер
COPY requirements.txt .

# Установите зависимости проекта
# --no-cache-dir используется для минимизации размера образа
RUN pip install --no-cache-dir -r requirements.txt

# Скопируйте файлы вашего проекта в контейнер
COPY . .

# Запустите команду для запуска вашего приложения
# В данном случае используется pytest
CMD [ "pytest", "-s", "-v", "--alluredir=allure-results" ]
